<!-- dflook/terraform-github-actions {"workspace":"multiarch-test-2","backend_type":"remote","backend":"75e5059998f0623a34d1da2255dd939f5d497073779487a472965902ee131786","plan_job_ref":"Job Test Terraform cloud #142 at https://github.com/dflook/terraform-github-actions/actions/runs/4377960102","plan_hash":"466c1a1937ffe756096ab219d2a9deead1ee6202b79aef1bd105f761db4e5b8b","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __multiarch-test-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #142](https://github.com/dflook/terraform-github-actions/actions/runs/4377960102)